Midterm_Case/Simple_Mesh/SteadyState/Turbulent/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       3895;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       3920;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       3945;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4000;
        startFace       4105;
    }
)

// ************************************************************************* //
